/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_str_chrset.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sdremora <sdremora@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/06 11:10:31 by sdremora          #+#    #+#             */
/*   Updated: 2019/02/06 11:52:30 by sdremora         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
**	Заменяет символы в исходной строке на переданный в аргументах.
**	начинает менять с индекса start и заканчивает через len байт.
**	'\0' - игнорируется и при необходимости заменяется.
*/

void		ft_str_chrset(char *line, int c, int start, int len)
{
	char	chr;
	int		i;

	chr = (char)c;
	i = 0;
	line = line + start;
	while (i < len)
	{
		line[i] = chr;
		i++;
	}
}
