/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_str_swap.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sdremora <sdremora@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/06 11:11:17 by sdremora          #+#    #+#             */
/*   Updated: 2019/02/06 12:05:09 by sdremora         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
**	Меняет местами символы в строке.
*/

void		ft_str_swap(char *str, int pos1, int pos2)
{
	char	temp;

	if (pos1 != pos2)
	{
		temp = str[pos1];
		str[pos1] = str[pos2];
		str[pos2] = temp;
	}
}
