/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_str_toupper.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sdremora <sdremora@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/06 11:12:06 by sdremora          #+#    #+#             */
/*   Updated: 2019/02/06 12:08:26 by sdremora         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
**	Переводит строчные буквы в строке на заглавные.
**	все остальные символы (не буквы) оставляет без изменений.
**	нулевую строку игнорирует.
*/

void		ft_str_toupper(char *str)
{
	size_t	n;

	n = 0;
	if (str == NULL)
		return ;
	while (str[n])
	{
		if (str[n] >= 'a' && str[n] <= 'z')
			str[n] = (str[n] - 32);
		n++;
	}
}
